{
  "irVersion": "1.0.0",
  "source": { "app": "figma", "exporterVersion": "0.1.0", "selectionCount": 1 },
  "document": {
    "name": "Fixture",
    "colorSpace": "srgb",
    "unit": "px",
    "yAxis": "down",
    "assets": {},
    "frames": [
      {
        "id": "1:1",
        "name": "Card",
        "width": 400,
        "height": 300,
        "buildMode": "PRECOMP",
        "clipsContent": true,
        "background": [{ "type": "SOLID", "color": { "r": 1, "g": 1, "b": 1, "a": 1 } }],
        "children": [
          {
            "id": "1:2",
            "type": "RECTANGLE",
            "name": "BG",
            "opacity": 1,
            "transform": { "x": 20, "y": 20, "width": 360, "height": 200, "rotation": 0 },
            "cornerRadii": { "topLeft": 16, "topRight": 16, "bottomRight": 16, "bottomLeft": 16 },
            "fills": [
              {
                "type": "GRADIENT_LINEAR",
                "opacity": 1,
                "stops": [
                  { "position": 0, "color": { "r": 0.2, "g": 0.4, "b": 0.9, "a": 1 } },
                  { "position": 1, "color": { "r": 0.6, "g": 0.2, "b": 0.8, "a": 1 } }
                ],
                "gradientHandles": [[0, 0], [360, 0], [0, 200]]
              }
            ]
          },
          {
            "id": "1:3",
            "type": "TEXT",
            "name": "Title",
            "transform": { "x": 40, "y": 60, "width": 320, "height": 40 },
            "text": {
              "characters": "Hello",
              "textAlignHorizontal": "LEFT",
              "runs": [
                {
                  "start": 0,
                  "end": 5,
                  "characters": "Hello",
                  "fontFamily": "Inter",
                  "fontStyle": "Bold",
                  "fontSize": 32,
                  "fills": [{ "type": "SOLID", "color": { "r": 1, "g": 1, "b": 1, "a": 1 } }]
                }
              ]
            }
          },
          {
            "id": "1:4",
            "type": "VECTOR",
            "name": "Tick",
            "transform": { "x": 40, "y": 160, "width": 24, "height": 24 },
            "fills": [{ "type": "SOLID", "color": { "r": 0.1, "g": 0.8, "b": 0.4, "a": 1 } }],
            "paths": [
              {
                "closed": false,
                "windingRule": "NONZERO",
                "vertices": [
                  { "x": 0, "y": 12, "inTangent": [0, 0], "outTangent": [0, 0] },
                  { "x": 8, "y": 20, "inTangent": [0, 0], "outTangent": [0, 0] },
                  { "x": 24, "y": 0, "inTangent": [0, 0], "outTangent": [0, 0] }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}
